# data types in python

In [1]:
30 #int

30

In [2]:
5.4 #float

5.4

In [3]:
'sarvesh' #string

'sarvesh'

In [4]:
True #bolean

True

In [20]:
a=[1,2,'sarvesh']  #it is list and it can contains any data type as seen above

In [21]:
# creating 2d list

[a,a]

[[1, 2, 'sarvesh'], [1, 2, 'sarvesh']]

In [7]:
' ' #empty

' '

# operators

In [8]:
1+1 #addition

2

In [9]:
'sar' + 'vesh'  #concatination

'sarvesh'

In [12]:
#we can know what data type does the variable has using type function

print(type('sarvesh'))

print(type(1))

<class 'str'>
<class 'int'>

In [13]:
a=10

In [14]:
a==10 #it will give bolean true if its correct or vice versa

True

In [18]:
a1=(10,'sarvesh',1000)  #it is like a list it is called as tuple the iteration is fater in tuple compared to list

In [19]:
type(a1) #as w.k.t it is used to know what data type it was

tuple

diff b/w list and tuple

In [17]:
#as we know that once we created tuple we cant replace the values thats why the itearation is faster in tuple

In [22]:
a

[1, 2, 'sarvesh']

In [23]:
a[1] #indexing

2

In [24]:
marks=[100,32,45,32,96,21,56]

In [25]:
pass_mark=35

In [27]:
marks[0]>=pass_mark #as we seen above and here we compare it with induvidual element in the list

True

In [28]:
if marks[0]>=pass_mark:
    print('pass')

pass

In [30]:
for i in range(7):
    print(i)

0
1
2
3
4
5
6

In [31]:
for i in range(len(marks)):
    print(marks[i])

100
32
45
32
96
21
56

In [33]:
for mark in marks:
    print(f'your mark is {mark}' )  
    if mark<pass_mark:
        print("ohhh you failed")
    else: 
        print("horrah you had passed")
    print("------------------")   #while using the for loop we can iterate induvidually and compare it with the pass_mark

your mark is 100
horrah you had passed
------------------
your mark is 32
ohhh you failed
------------------
your mark is 45
horrah you had passed
------------------
your mark is 32
ohhh you failed
------------------
your mark is 96
horrah you had passed
------------------
your mark is 21
ohhh you failed
------------------
your mark is 56
horrah you had passed
------------------

In [35]:
for mark in marks:
    print(mark)  
    if(mark<pass_mark)&(mark>20):
        print("grace")
    elif(mark<pass_mark)&(mark<=20):
        print("fail")
    else: 
        print("pass")
    print("------------------")        #elif is used if there are more than one condition and the symbol '&' represent and it will be executed when both the condition is said to be true

100
pass
------------------
32
grace
------------------
45
pass
------------------
32
grace
------------------
96
pass
------------------
21
grace
------------------
56
pass
------------------

# function

In [36]:
def sum(a,b):
    return a+b  #it will sum both the input

In [37]:
sum(100,392)

492

In [38]:
def foo_diff(num1 = 0, num2 = 0):
    print(num1)
    return num1-num2

In [40]:
foo_diff()

0

0

In [42]:
foo_diff(100,230)

100

-130

In [43]:
import pandas as pd
import numpy as np

In [45]:
marks_series=pd.Series(marks) #it will indicate the index number too
marks_series

0    100
1     32
2     45
3     32
4     96
5     21
6     56
dtype: int64

In [46]:
marks_series.index

RangeIndex(start=0, stop=7, step=1)

In [47]:
marks_series.values

array([100,  32,  45,  32,  96,  21,  56], dtype=int64)

In [48]:
marks_series[5] #indexing

21

In [51]:
marks_series[5]=np.nan

In [52]:
marks_series

0    100
1     32
2     45
3     32
4     96
5    NaN
6     56
dtype: object

In [53]:
marks_series.value_counts()  #it will say that how many times the induvidual value repeats

32     2
96     1
100    1
45     1
56     1
dtype: int64

In [55]:
sample_df = pd.DataFrame([marks, marks]).T
sample_df #the data frame is used to show values in the form of table

     0    1
0  100  100
1   32   32
2   45   45
3   32   32
4   96   96
5   21   21
6   56   56

In [56]:
sample_df.columns = ['marks01', 'marks02']

In [57]:
sample_df

   marks01  marks02
0      100      100
1       32       32
2       45       45
3       32       32
4       96       96
5       21       21
6       56       56

In [61]:
df = pd.read_csv("tips_cleaned.csv")

In [62]:
df

     Unnamed: 0  total_bill   tip     sex smoker       day    time  size
0             0       16.99  1.01  Female     No    Sunday  Dinner     2
1             1       10.34  1.66    Male     No    Sunday  Dinner     3
2             2       21.01  3.50    Male     No    Sunday  Dinner     3
3             3       23.68  3.31    Male     No    Sunday  Dinner     2
4             4       24.59  3.61  Female     No    Sunday  Dinner     4
..          ...         ...   ...     ...    ...       ...     ...   ...
239         239       29.03  5.92    Male     No  Saturday  Dinner     3
240         240       27.18  2.00  Female    Yes  Saturday  Dinner     2
241         241       22.67  2.00    Male    Yes  Saturday  Dinner     2
242         242       17.82  1.75    Male     No  Saturday  Dinner     2
243         243       18.78  3.00  Female     No  Thursday  Dinner     2

[244 rows x 8 columns]

some familiar operation on data set

In [63]:
df.head()

   Unnamed: 0  total_bill   tip     sex smoker     day    time  size
0           0       16.99  1.01  Female     No  Sunday  Dinner     2
1           1       10.34  1.66    Male     No  Sunday  Dinner     3
2           2       21.01  3.50    Male     No  Sunday  Dinner     3
3           3       23.68  3.31    Male     No  Sunday  Dinner     2
4           4       24.59  3.61  Female     No  Sunday  Dinner     4

In [64]:
df.tail()

     Unnamed: 0  total_bill   tip     sex smoker       day    time  size
239         239       29.03  5.92    Male     No  Saturday  Dinner     3
240         240       27.18  2.00  Female    Yes  Saturday  Dinner     2
241         241       22.67  2.00    Male    Yes  Saturday  Dinner     2
242         242       17.82  1.75    Male     No  Saturday  Dinner     2
243         243       18.78  3.00  Female     No  Thursday  Dinner     2

In [65]:
df['total_bill']  #picking up only  one column

0      16.99
1      10.34
2      21.01
3      23.68
4      24.59
       ...
239    29.03
240    27.18
241    22.67
242    17.82
243    18.78
Name: total_bill, Length: 244, dtype: float64

In [67]:
type(df['total_bill']) #its like a series

pandas.core.series.Series

In [68]:
df['total_bill'].value_counts()

13.42    3
21.01    2
18.29    2
10.07    2
20.69    2
        ..
24.27    1
38.07    1
7.51     1
14.52    1
26.88    1
Name: total_bill, Length: 229, dtype: int64

In [70]:
df.shape #1st represent row and after that it is column

(244, 8)

In [73]:
df.isna().sum() #this is used to know the null values

Unnamed: 0     0
total_bill     0
tip            0
sex            0
smoker         0
day           19
time           0
size           0
dtype: int64

In [72]:
df.fillna(0) #it fills the null values with 0

     Unnamed: 0  total_bill   tip     sex smoker       day    time  size
0             0       16.99  1.01  Female     No    Sunday  Dinner     2
1             1       10.34  1.66    Male     No    Sunday  Dinner     3
2             2       21.01  3.50    Male     No    Sunday  Dinner     3
3             3       23.68  3.31    Male     No    Sunday  Dinner     2
4             4       24.59  3.61  Female     No    Sunday  Dinner     4
..          ...         ...   ...     ...    ...       ...     ...   ...
239         239       29.03  5.92    Male     No  Saturday  Dinner     3
240         240       27.18  2.00  Female    Yes  Saturday  Dinner     2
241         241       22.67  2.00    Male    Yes  Saturday  Dinner     2
242         242       17.82  1.75    Male     No  Saturday  Dinner     2
243         243       18.78  3.00  Female     No  Thursday  Dinner     2

[244 rows x 8 columns]

In [74]:
df.columns   #is used to know the column names

Index(['Unnamed: 0', 'total_bill', 'tip', 'sex', 'smoker', 'day', 'time',
       'size'],
      dtype='object')

In [75]:
df[['total_bill','sex']]

     total_bill     sex
0         16.99  Female
1         10.34    Male
2         21.01    Male
3         23.68    Male
4         24.59  Female
..          ...     ...
239       29.03    Male
240       27.18  Female
241       22.67    Male
242       17.82    Male
243       18.78  Female

[244 rows x 2 columns]

In [76]:
#or 
a=['total_bill','sex']
df[a]

     total_bill     sex
0         16.99  Female
1         10.34    Male
2         21.01    Male
3         23.68    Male
4         24.59  Female
..          ...     ...
239       29.03    Male
240       27.18  Female
241       22.67    Male
242       17.82    Male
243       18.78  Female

[244 rows x 2 columns]

In [77]:
list('sarvesh') #through this the string got converted into list

['s', 'a', 'r', 'v', 'e', 's', 'h']

dict has key and values-->we can iterate it through keys

In [79]:
dict1={'sno':list('sarvesh'),'marks':marks}

In [80]:
dict1

{'sno': ['s', 'a', 'r', 'v', 'e', 's', 'h'],
 'marks': [100, 32, 45, 32, 96, 21, 56]}

In [82]:
df2=pd.DataFrame(dict1)
df2

  sno  marks
0   s    100
1   a     32
2   r     45
3   v     32
4   e     96
5   s     21
6   h     56

In [84]:
df['total_bill']>10

0      True
1      True
2      True
3      True
4      True
       ...
239    True
240    True
241    True
242    True
243    True
Name: total_bill, Length: 244, dtype: bool

In [86]:
df[df['total_bill']>10] #it will display the row which has greater than 10

     Unnamed: 0  total_bill   tip     sex smoker       day    time  size
0             0       16.99  1.01  Female     No    Sunday  Dinner     2
1             1       10.34  1.66    Male     No    Sunday  Dinner     3
2             2       21.01  3.50    Male     No    Sunday  Dinner     3
3             3       23.68  3.31    Male     No    Sunday  Dinner     2
4             4       24.59  3.61  Female     No    Sunday  Dinner     4
..          ...         ...   ...     ...    ...       ...     ...   ...
239         239       29.03  5.92    Male     No  Saturday  Dinner     3
240         240       27.18  2.00  Female    Yes  Saturday  Dinner     2
241         241       22.67  2.00    Male    Yes  Saturday  Dinner     2
242         242       17.82  1.75    Male     No  Saturday  Dinner     2
243         243       18.78  3.00  Female     No  Thursday  Dinner     2

[227 rows x 8 columns]

In [88]:
df.corr() #corr is used to know linear relationship b/w the variables

            Unnamed: 0  total_bill       tip      size
Unnamed: 0    1.000000    0.044526 -0.026709  0.008061
total_bill    0.044526    1.000000  0.675734  0.598315
tip          -0.026709    0.675734  1.000000  0.489299
size          0.008061    0.598315  0.489299  1.000000

In [89]:
df.describe() #basic stat related to the data

       Unnamed: 0  total_bill         tip        size
count  244.000000  244.000000  244.000000  244.000000
mean   121.500000   19.785943    2.998279    2.569672
std     70.580923    8.902412    1.383638    0.951100
min      0.000000    3.070000    1.000000    1.000000
25%     60.750000   13.347500    2.000000    2.000000
50%    121.500000   17.795000    2.900000    2.000000
75%    182.250000   24.127500    3.562500    3.000000
max    243.000000   50.810000   10.000000    6.000000

In [91]:
df.info()  # this will give structure of data

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  244 non-null    int64
 1   total_bill  244 non-null    float64
 2   tip         244 non-null    float64
 3   sex         244 non-null    object
 4   smoker      244 non-null    object
 5   day         225 non-null    object
 6   time        244 non-null    object
 7   size        244 non-null    int64
dtypes: float64(2), int64(2), object(4)
memory usage: 15.4+ KB